/**
 * 模擬api
 */

let dataToday = {
	"apiId": "SPEC05030101",
	"token": {
		"requestId": "28c534653d5945931606196876371",
		"responseTime": "2020-11-24 13:48:08",
		"lang": "zh_TW"
	},
	"resFlag": "0",
	"resContent": {
		"account": {
			"currencyCode": "NTD",
			"accountId": "24203000299880"
		},
		"rowData": [
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "89,948.00",
				"remark": "NT29203000157240",
				'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!'
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "2,360.00",
				"crAmt": "",
				"balAmt": "97,588.00",
				"remark": "786-0024566",
				'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!'
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-2,360.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0024566"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,738.00",
				"crAmt": "",
				"balAmt": "98,210.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,738.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,249.00",
				"crAmt": "",
				"balAmt": "98,699.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,249.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "17,176.00",
				"crAmt": "",
				"balAmt": "82,772.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-17,176.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "17,177.00",
				"crAmt": "",
				"balAmt": "82,771.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-17,177.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "TD24191000313362"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "1,388.00",
				"crAmt": "",
				"balAmt": "98,560.00",
				"remark": "NT02203007744476"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "108,560.00",
				"remark": "29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,722.00",
				"crAmt": "",
				"balAmt": "106,838.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,722.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "107,555.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "100.00",
				"crAmt": "",
				"balAmt": "108,460.00",
				"remark": "NT03203005800026"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "50,000.00",
				"crAmt": "",
				"balAmt": "58,460.00",
				"remark": "TD24191000313508"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "93.00",
				"balAmt": "58,553.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "488.00",
				"balAmt": "59,041.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "58,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "57,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "56,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "46,041.00",
				"remark": "TD24292000313534"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "36,041.00",
				"remark": "TD24293000313549"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "26,041.00",
				"remark": "TD24293000313557"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "16,041.00",
				"remark": "TD24293000313565"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "6,041.00",
				"remark": "TD24293000313573"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-3,959.00",
				"remark": "TD24293000313581"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-13,959.00",
				"remark": "TD24293000313599"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-23,959.00",
				"remark": "TD24293000313604"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-33,959.00",
				"remark": "TD24292000313615"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-43,959.00",
				"remark": "TD24292000313623"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-53,959.00",
				"remark": "TD24292000313631"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "3,349.00",
				"balAmt": "-50,610.00",
				"remark": "0000744@33.4900"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-46,332.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-42,054.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "6,417.00",
				"balAmt": "-35,637.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "2,105.00",
				"balAmt": "-33,532.00",
				"remark": "0000744@2.1050"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "11,478.00",
				"balAmt": "-22,054.00",
				"remark": "0000744@3.8260"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "-23,054.00",
				"remark": "0000744@3.8710"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "",
				"crAmt": "",
				"balAmt": "-23,054.00",
				"remark": ""
			}
		],
		"totalData": {
			"totalCrAmt": "247,974.00",
			"totalDrAmt": "247,974.00",
			"totalDrCount": "48",
			"totalCrCount": "12"
        },
		"paginator": {
			"totalCount": "60",
			"pageSize": "200",
			"pageNumber": "1",
			"sortColName": "txDate",
			"sortDirection": "ASC"
		}
	}
};
// {
//     'resContent': {
//         'rowData': [
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '21111', 'remark': '011-02121000555571轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '10000', 'balAmt': '31111', 'remark': '011-02121000559556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '51111', 'remark': '011-02121000566953轉入' },
//             { 'txDate': '2019-11-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '3000', 'drAmt': '0', 'balAmt': '48111', 'remark': '011-021210007755685轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '3000', 'drAmt': '0', 'balAmt': '45111', 'remark': '011-02121000456695轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5000', 'drAmt': '0', 'balAmt': '42111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '6000', 'drAmt': '0', 'balAmt': '41111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '3000', 'balAmt': '45111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '1000', 'drAmt': '0', 'balAmt': '46111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '10000', 'drAmt': '0', 'balAmt': '47111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '2000', 'balAmt': '38111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '2000', 'balAmt': '36111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '1000', 'drAmt': '0', 'balAmt': '40111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '500', 'drAmt': '0', 'balAmt': '42111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '300', 'drAmt': '0', 'balAmt': '38111', 'remark': '011-02121000798556轉入' },
//             { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '1000', 'drAmt': '0', 'balAmt': '41111', 'remark': '011-02121000798556轉入' },
//         ],
//         'totalData': {
//             'totalDramt': '110000',
//             'totalCramt': '360000',
//             'totalDramtCount': '9',
//             'totalCramtCount': '6'
//         },
//         'account': {
//             'accountId': '05108000019026',
//             'accountNickName': '0510nickName_Jerry',
//             'currencyCode': 'USD',
//             'currencyName': '美金'
//         },
//         'warningMsg': '請注意：目前顯示之餘額/資料尚不包含前一營業日批次待入扣帳之餘額/資料!!',
//         'paginator': {
//             'totalCount': '30',
//             'pageSize': '15',
//             'pageNumber': '5',
//             'sortColName': '',
//             'sortDirection': 'DESC'
//         }
//     }
// };
let data7D = {
    'resContent': {
        'rowData': [
            { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '31111', 'remark': '011-02121000766585轉入' },
            { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '41111', 'remark': '011-02121000445652轉入' },
            { 'txDate': '2019-10-08', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '50000', 'balAmt': '61111', 'remark': '011-02121000765223轉入' },
            { 'txDate': '2019-10-09', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '4000', 'drAmt': '0', 'balAmt': '78111', 'remark': '011-021210004446594轉入' },
            { 'txDate': '2019-10-09', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '6000', 'drAmt': '0', 'balAmt': '85111', 'remark': '011-021210007998565轉入' },
            { 'txDate': '2019-10-09', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7000', 'drAmt': '0', 'balAmt': '90111', 'remark': '011-021210007985567轉入' },
            { 'txDate': '2019-10-10', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '31111', 'remark': '011-02121000766585轉入' },
            { 'txDate': '2019-10-10', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '1000', 'balAmt': '41111', 'remark': '011-02121000445652轉入' },
            { 'txDate': '2019-10-11', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '10000', 'balAmt': '61111', 'remark': '011-02121000765223轉入' },
            { 'txDate': '2019-10-12', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5000', 'drAmt': '0', 'balAmt': '78111', 'remark': '011-021210004446594轉入' },
            { 'txDate': '2019-10-12', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '500', 'drAmt': '0', 'balAmt': '85111', 'remark': '011-021210007998565轉入' },
            { 'txDate': '2019-10-12', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '1000', 'drAmt': '0', 'balAmt': '90111', 'remark': '011-021210007985567轉入' },
            { 'txDate': '2019-10-13', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '31111', 'remark': '011-02121000766585轉入' },
            { 'txDate': '2019-10-13', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '12000', 'balAmt': '41111', 'remark': '011-02121000445652轉入' },
            { 'txDate': '2019-10-13', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '3000', 'balAmt': '61111', 'remark': '011-02121000765223轉入' },
            { 'txDate': '2019-10-13', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '3000', 'drAmt': '0', 'balAmt': '85111', 'remark': '011-021210007998565轉入' },
            { 'txDate': '2019-10-13', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5000', 'drAmt': '0', 'balAmt': '90111', 'remark': '011-021210007985567轉入' },
            { 'txDate': '2019-10-14', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '2000', 'balAmt': '31111', 'remark': '011-02121000766585轉入' },
            { 'txDate': '2019-10-14', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '41111', 'remark': '011-02121000445652轉入' },
            { 'txDate': '2019-10-14', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '50000', 'balAmt': '61111', 'remark': '011-02121000765223轉入' },
            { 'txDate': '2019-10-15', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '4000', 'drAmt': '0', 'balAmt': '78111', 'remark': '011-021210004446594轉入' },
            { 'txDate': '2019-10-15', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '10000', 'drAmt': '0', 'balAmt': '85111', 'remark': '011-021210007998565轉入' },
            { 'txDate': '2019-10-15', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7000', 'drAmt': '0', 'balAmt': '90111', 'remark': '011-021210007985567轉入' }
        ],
        'totalData': {
            'totalDramt': '11000',
            'totalCramt': '50000',
            'totalDramtCount': '11',
            'totalCramtCount': '12'
        },
        'account': {
            'accountId': '05108000019026',
            'accountNickName': '0510nickName_Jerry',
            'currencyCode': 'USD',
            'currencyName': '美金'
        },
        'warningMsg': '請注意：目前顯示之餘額/資料尚不包含前一營業日批次待入扣帳之餘額/資料!!',
        'paginator': {
            'totalCount': '30',
            'pageSize': '10',
            'pageNumber': '5',
            'sortColName': '',
            'sortDirection': 'DESC'
        }
    }
};
let data1M = {
    'resContent': {
        'rowData': [
            { 'txDate': '2019-10-09', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '18000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-10', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '9000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' },
            { 'txDate': '2019-10-11', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '15000', 'balAmt': '61111', 'remark': '011-021210004456526轉入' },
            { 'txDate': '2019-10-11', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '14500', 'drAmt': '0', 'balAmt': '88111', 'remark': '011-021210007779853轉入' },
            { 'txDate': '2019-10-12', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '16500', 'drAmt': '0', 'balAmt': '95111', 'remark': '011-021210007779985轉入' },
            { 'txDate': '2019-10-13', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5500', 'drAmt': '0', 'balAmt': '100111', 'remark': '011-02121000555696轉入' },
            { 'txDate': '2019-10-13', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '12000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-14', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '9000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' },
            { 'txDate': '2019-10-14', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '19000', 'balAmt': '61111', 'remark': '011-021210004456526轉入' },
            { 'txDate': '2019-10-14', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '4600', 'drAmt': '0', 'balAmt': '88111', 'remark': '011-021210007779853轉入' },
            { 'txDate': '2019-10-15', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7500', 'drAmt': '0', 'balAmt': '95111', 'remark': '011-021210007779985轉入' },
            { 'txDate': '2019-10-16', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '10000', 'drAmt': '0', 'balAmt': '100111', 'remark': '011-02121000555696轉入' },
            { 'txDate': '2019-10-17', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '3000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-17', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '30000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' },
            { 'txDate': '2019-10-17', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '150000', 'balAmt': '61111', 'remark': '011-021210004456526轉入' },
            { 'txDate': '2019-10-18', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '3000', 'drAmt': '0', 'balAmt': '88111', 'remark': '011-021210007779853轉入' },
            { 'txDate': '2019-10-18', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7000', 'drAmt': '0', 'balAmt': '95111', 'remark': '011-021210007779985轉入' },
            { 'txDate': '2019-10-20', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5500', 'drAmt': '0', 'balAmt': '100111', 'remark': '011-02121000555696轉入' },
            { 'txDate': '2019-10-20', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '1000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-20', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '2000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' },
            { 'txDate': '2019-10-21', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '500', 'balAmt': '61111', 'remark': '011-021210004456526轉入' },
            { 'txDate': '2019-10-22', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '4200', 'drAmt': '0', 'balAmt': '88111', 'remark': '011-021210007779853轉入' },
            { 'txDate': '2019-10-23', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7000', 'drAmt': '0', 'balAmt': '95111', 'remark': '011-021210007779985轉入' },
            { 'txDate': '2019-10-24', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '8000', 'drAmt': '0', 'balAmt': '100111', 'remark': '011-02121000555696轉入' },
            { 'txDate': '2019-10-24', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-24', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '10000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' },
            { 'txDate': '2019-10-25', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '9600', 'balAmt': '61111', 'remark': '011-021210004456526轉入' },
            { 'txDate': '2019-10-25', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '5500', 'drAmt': '0', 'balAmt': '88111', 'remark': '011-021210007779853轉入' },
            { 'txDate': '2019-10-25', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '10000', 'drAmt': '0', 'balAmt': '95111', 'remark': '011-021210007779985轉入' },
            { 'txDate': '2019-10-26', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '20000', 'drAmt': '0', 'balAmt': '100111', 'remark': '011-02121000555696轉入' },
            { 'txDate': '2019-10-24', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '41111', 'remark': '011-02121000756685轉入' },
            { 'txDate': '2019-10-24', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '10000', 'balAmt': '51111', 'remark': '011-02121000665958轉入' }
        ],
        'totalData': {
            'totalDramt': '200000',
            'totalCramt': '500000',
            'totalDramtCount': '15',
            'totalCramtCount': '17'
        },
        'account': {
            'accountId': '05108000019026',
            'accountNickName': '0510nickName_Jerry',
            'currencyCode': 'USD',
            'currencyName': '美金'
        },
        'warningMsg': '請注意：目前顯示之餘額/資料尚不包含前一營業日批次待入扣帳之餘額/資料!!',
        'paginator': {
            'totalCount': '30',
            'pageSize': '10',
            'pageNumber': '5',
            'sortColName': '',
            'sortDirection': 'DESC'
        }
    }
};
let dataCustom = {
    'resContent': {
        'rowData': [
            { 'txDate': '2019-10-06', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '150000', 'balAmt': '51111', 'remark': '011-02121000665985轉入' },
            { 'txDate': '2019-10-06', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '200000', 'balAmt': '61111', 'remark': '011-02121000778569轉入' },
            { 'txDate': '2019-10-08', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '100000', 'balAmt': '71111', 'remark': '011-021210009985687轉入' },
            { 'txDate': '2019-10-15', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '17500', 'drAmt': '0', 'balAmt': '98111', 'remark': '011-021210007569955轉入' },
            { 'txDate': '2019-10-16', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '14500', 'drAmt': '0', 'balAmt': '105111', 'remark': '011-02121000623325轉入' },
            { 'txDate': '2019-10-17', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '6000', 'drAmt': '0', 'balAmt': '110111', 'remark': '011-02121000111256轉入' },
            { 'txDate': '2019-10-18', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '15000', 'balAmt': '51111', 'remark': '011-02121000665985轉入' },
            { 'txDate': '2019-10-18', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '61111', 'remark': '011-02121000778569轉入' },
            { 'txDate': '2019-10-19', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '9500', 'balAmt': '71111', 'remark': '011-021210009985687轉入' },
            { 'txDate': '2019-10-20', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '10500', 'drAmt': '0', 'balAmt': '98111', 'remark': '011-021210007569955轉入' },
            { 'txDate': '2019-10-21', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '4500', 'drAmt': '0', 'balAmt': '105111', 'remark': '011-02121000623325轉入' },
            { 'txDate': '2019-10-21', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '2000', 'drAmt': '0', 'balAmt': '110111', 'remark': '011-02121000111256轉入' },
            { 'txDate': '2019-10-22', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '15000', 'balAmt': '51111', 'remark': '011-02121000665985轉入' },
            { 'txDate': '2019-10-23', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '20000', 'balAmt': '61111', 'remark': '011-02121000778569轉入' },
            { 'txDate': '2019-10-24', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '9500', 'balAmt': '71111', 'remark': '011-021210009985687轉入' },
            { 'txDate': '2019-10-24', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7500', 'drAmt': '0', 'balAmt': '98111', 'remark': '011-021210007569955轉入' },
            { 'txDate': '2019-10-24', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '4500', 'balAmt': '105111', 'remark': '011-02121000623325轉入' },
            { 'txDate': '2019-10-25', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '8600', 'drAmt': '0', 'balAmt': '110111', 'remark': '011-02121000111256轉入' },
            { 'txDate': '2019-10-25', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '100000', 'balAmt': '51111', 'remark': '011-02121000665985轉入' },
            { 'txDate': '2019-10-26', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '26000', 'balAmt': '61111', 'remark': '011-02121000778569轉入' },
            { 'txDate': '2019-10-26', 'memo': '網路轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '36000', 'balAmt': '71111', 'remark': '011-021210009985687轉入' },
            { 'txDate': '2019-10-27', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '7500', 'drAmt': '0', 'balAmt': '98111', 'remark': '011-021210007569955轉入' },
            { 'txDate': '2019-10-28', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '0', 'drAmt': '4500', 'balAmt': '105111', 'remark': '011-02121000623325轉入' },
            { 'txDate': '2019-10-29', 'memo': '批次轉帳', 'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!', 'crAmt': '75000', 'drAmt': '0', 'balAmt': '110111', 'remark': '011-02121000111256轉入' }
        ],
        'totalData': {
            'totalDramt': '70000',
            'totalCramt': '150000',
            'totalDramtCount': '10',
            'totalCramtCount': '14'
        },
        'account': {
            'accountId': '05108000019026',
            'accountNickName': '0510nickName_Jerry',
            'currencyCode': 'USD',
            'currencyName': '美金'
        },
        'warningMsg': '請注意：目前顯示之餘額/資料尚不包含前一營業日批次待入扣帳之餘額/資料!!',
        'paginator': {
            'totalCount': '30',
            'pageSize': '10',
            'pageNumber': '5',
            'sortColName': '',
            'sortDirection': 'DESC'
        }
    }
};

let df_response = {
    "apiId": "SPEC10020001",
    "token": {
        "requestId": "",
        "responseTime": "",
        "lang": "TW"
    },
    "resFlag": "0",
    "resMessage": {
        "errorCode": "",
        "errorMsg": ""
    },
    "resContent": {
        "rowData": [{
            "txDate": "2019-10-08",
            "memo": "網路轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "0",
            "drAmt": "20000",
            "balAmt": "21111"
            , "remark": "NT02204000007528"
        }, {
            "txDate": "2019-10-09",
            "memo": "批次轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "0",
            "drAmt": "10000",
            "balAmt": "31111"
            , "remark": "NT02204000007528"
        }, {
            "txDate": "2019-10-10",
            "memo": "網路轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "0",
            "drAmt": "20000",
            "balAmt": "51111"
            , "remark": "NT02204000007528"
        }, {
            "txDate": "2019-11-14",
            "memo": "網路轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "3000",
            "drAmt": "0",
            "balAmt": "48111"
            , "remark": "NT02204000007528"
        }, {
            "txDate": "2019-10-18",
            "memo": "批次轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "3000",
            "drAmt": "0",
            "balAmt": "45111"
            , "remark": "NT02204000007528"
        }, {
            "txDate": "2019-12-26",
            "memo": "網路轉帳",
            'warningMsg': '請注意：目前顯示之餘額/資料尚不包含今日批次待入扣帳之餘額/資料!!',
            "crAmt": "5000",
            "drAmt": "0",
            "balAmt": "40111"
            , "remark": "NT02204000007528"
        }],
        "totalData": {
            "totalDrawal": "11000",
            "totalDeposit": "50000",
            "totalDrawalCount": "3",
            "totalDepositCount": "3"
        },
        "account": {
            " accountId ": "05108000019026",
            "accountNickName": "0510nickName_Jerry",
            "currencyCode": "USD",
            'currencyName': '美金'
        },
        "warningMsg": "請注意：目前顯示之餘額/資料尚不包含前一營業日批次待入扣帳之餘額/資料!!",
        "paginator": {
            "totalCount": "20",
            "pageSize": "10",
            "pageNumber": "5",
            "sortColName": "",
            "sortDirection": "DESC",
        }
    }
};

export const api_real = {
	"apiId": "SPEC05030101",
	"token": {
		"requestId": "28c534653d5945931606196876371",
		"responseTime": "2020-11-24 13:48:08",
		"lang": "zh_TW"
	},
	"resFlag": "0",
	"resContent": {
		"account": {
			"currencyCode": "NTD",
			"accountId": "24203000299880"
		},
		"rowData": [
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "89,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "2,360.00",
				"crAmt": "",
				"balAmt": "97,588.00",
				"remark": "786-0024566"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-2,360.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0024566"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,738.00",
				"crAmt": "",
				"balAmt": "98,210.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,738.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,249.00",
				"crAmt": "",
				"balAmt": "98,699.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,249.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "17,176.00",
				"crAmt": "",
				"balAmt": "82,772.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-17,176.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "17,177.00",
				"crAmt": "",
				"balAmt": "82,771.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-17,177.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "TD24191000313362"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "1,388.00",
				"crAmt": "",
				"balAmt": "98,560.00",
				"remark": "NT02203007744476"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "108,560.00",
				"remark": "29203000157240"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,722.00",
				"crAmt": "",
				"balAmt": "106,838.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,722.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "107,555.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "100.00",
				"crAmt": "",
				"balAmt": "108,460.00",
				"remark": "NT03203005800026"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "50,000.00",
				"crAmt": "",
				"balAmt": "58,460.00",
				"remark": "TD24191000313508"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "93.00",
				"balAmt": "58,553.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-24",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "488.00",
				"balAmt": "59,041.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "58,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "57,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "56,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "46,041.00",
				"remark": "TD24292000313534"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "36,041.00",
				"remark": "TD24293000313549"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "26,041.00",
				"remark": "TD24293000313557"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "16,041.00",
				"remark": "TD24293000313565"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "6,041.00",
				"remark": "TD24293000313573"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-3,959.00",
				"remark": "TD24293000313581"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-13,959.00",
				"remark": "TD24293000313599"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-23,959.00",
				"remark": "TD24293000313604"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-33,959.00",
				"remark": "TD24292000313615"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-43,959.00",
				"remark": "TD24292000313623"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-53,959.00",
				"remark": "TD24292000313631"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "3,349.00",
				"balAmt": "-50,610.00",
				"remark": "0000744@33.4900"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-46,332.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-42,054.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "6,417.00",
				"balAmt": "-35,637.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "2,105.00",
				"balAmt": "-33,532.00",
				"remark": "0000744@2.1050"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "11,478.00",
				"balAmt": "-22,054.00",
				"remark": "0000744@3.8260"
			},
			{
				"txDate": "2020-11-24",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "-23,054.00",
				"remark": "0000744@3.8710"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "",
				"crAmt": "",
				"balAmt": "-23,054.00",
				"remark": ""
			}
		],
		"totalData": {
			"totalCrAmt": "247,974.00",
			"totalDrAmt": "247,974.00",
			"totalDrCount": "48",
			"totalCrCount": "12"
        },
		"paginator": {
			"totalCount": "60",
			"pageSize": "200",
			"pageNumber": "1",
			"sortColName": "txDate",
			"sortDirection": "ASC"
		}
	}
};

export const api_real2 = {
	"apiId": "SPEC05030101",
	"token": {
		"requestId": "b693f343d593c2fb1606113145443",
		"responseTime": "2020-11-23 14:32:37",
		"lang": "zh_TW"
	},
	"resFlag": "0",
	"resContent": {
		"account": {
			"currencyCode": "NTD",
			"accountId": "24203000299880"
		},
		"rowData": [
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "",
				"balAmt": "-42,054.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-42,054.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "4,278.00",
				"balAmt": "-46,332.00",
				"remark": "0000744@4.2780"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "",
				"crAmt": "3,349.00",
				"balAmt": "-50,610.00",
				"remark": "0000744@33.4900"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-53,959.00",
				"remark": "TD24292000313631"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-43,959.00",
				"remark": "TD24292000313623"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-33,959.00",
				"remark": "TD24292000313615"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-23,959.00",
				"remark": "TD24293000313604"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-13,959.00",
				"remark": "TD24293000313599"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "-3,959.00",
				"remark": "TD24293000313581"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "6,041.00",
				"remark": "TD24293000313573"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "16,041.00",
				"remark": "TD24293000313565"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "26,041.00",
				"remark": "TD24293000313557"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "36,041.00",
				"remark": "TD24293000313549"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "46,041.00",
				"remark": "TD24292000313534"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "56,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "57,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉帳",
				"drAmt": "1,000.00",
				"crAmt": "",
				"balAmt": "58,041.00",
				"remark": "0000744@30.0150"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "488.00",
				"balAmt": "59,041.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "93.00",
				"balAmt": "58,553.00",
				"remark": "測試資料"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "50,000.00",
				"crAmt": "",
				"balAmt": "58,460.00",
				"remark": "TD24191000313508"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "100.00",
				"crAmt": "",
				"balAmt": "108,460.00",
				"remark": "NT03203005800026"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "107,555.00",
				"remark": "006-8901234"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,722.00",
				"crAmt": "",
				"balAmt": "108,560.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,722.00",
				"crAmt": "",
				"balAmt": "106,838.00",
				"remark": "588-0172727"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "108,560.00",
				"remark": "29203000157240"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "1,388.00",
				"crAmt": "",
				"balAmt": "98,560.00",
				"remark": "NT02203007744476"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-1123456"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,005.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,005.00",
				"crAmt": "",
				"balAmt": "88,943.00",
				"remark": "008-3098899"
			},
			{
				"txDate": "2020-11-23",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "89,948.00",
				"remark": "TD24191000313362"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "987-2776584"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-10,005.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "10,005.00",
				"crAmt": "",
				"balAmt": "89,943.00",
				"remark": "986-2776584"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-17,177.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "17,177.00",
				"crAmt": "",
				"balAmt": "82,771.00",
				"remark": "786-0017272"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-17,176.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "17,176.00",
				"crAmt": "",
				"balAmt": "82,772.00",
				"remark": "786-1727373"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,249.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,249.00",
				"crAmt": "",
				"balAmt": "98,699.00",
				"remark": "986-2737474"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-1,738.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "1,738.00",
				"crAmt": "",
				"balAmt": "98,210.00",
				"remark": "778-3858558"
			},
			{
				"txDate": "2020-11-23",
				"memo": "更正",
				"drAmt": "-2,360.00",
				"crAmt": "",
				"balAmt": "99,948.00",
				"remark": "786-0024566"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路跨轉",
				"drAmt": "2,360.00",
				"crAmt": "",
				"balAmt": "97,588.00",
				"remark": "786-0024566"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "99,948.00",
				"remark": "NT29203000157240"
			},
			{
				"txDate": "2020-11-23",
				"memo": "網路轉帳",
				"drAmt": "",
				"crAmt": "10,000.00",
				"balAmt": "89,948.00",
				"remark": "NT29203000157240"
			}
		],
		"totalData": {
			"totalCrAmt": "226,974.00",
			"totalDrCount": "47",
			"totalCrCount": "9"
		},
		"paginator": {
			"totalCount": "56",
			"pageSize": "200",
			"pageNumber": "1",
			"sortColName": "txDate",
			"sortDirection": "DESC"
		}
	}
};

export const api_real3 = {
	"apiId": "SPEC05030101",
	"token": {
		"requestId": "ab72a746e5461ce11606204700981",
		"responseTime": "2020-11-24 15:58:30",
		"lang": "zh_TW"
	},
	"resFlag": "0",
	"resContent": {
		"account": {
			"currencyCode": "NTD",
			"accountId": "02203007474796"
		},
		"rowData": [
			{
				"txDate": "2020-11-24",
				"memo": "轉存定存",
				"drAmt": "10,000.00",
				"crAmt": "",
				"balAmt": "20,326.00",
				"remark": "TD02293001752001"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,326.00",
				"remark": "011-0357319"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "",
				"crAmt": "-1.00",
				"balAmt": "30,325.00",
				"remark": "011-0357319"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,326.00",
				"remark": "011-0357319"
			},
			{
				"txDate": "2020-11-24",
				"memo": "更正",
				"drAmt": "",
				"crAmt": "-1.00",
				"balAmt": "30,325.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,326.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,325.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,324.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "1.00",
				"balAmt": "30,323.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "30,000.00",
				"balAmt": "30,322.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "161.00",
				"balAmt": "322.00",
				"remark": "011-0777777"
			},
			{
				"txDate": "2020-11-24",
				"memo": "HCE 轉帳",
				"drAmt": "",
				"crAmt": "161.00",
				"balAmt": "161.00",
				"remark": "011-0777777"
			}
		],
		"totalData": {
			"totalCrAmt": "40,326.00",
			"totalDrCount": "1",
			"totalCrCount": "11"
		},
		"paginator": {
			"totalCount": "12",
			"pageSize": "200",
			"pageNumber": "1",
			"sortColName": "txDate",
			"sortDirection": "DESC"
		}
	}
};

export const api_response = {...df_response, ...dataToday};
export const api_response7D = {...df_response, ...data7D};
export const api_response1M = {...df_response, ...data1M};
export const api_responseCustom = {...df_response, ...dataCustom};
export const api_error = {
    'apiId': 'SPEC06010102',
    'token': {
        'requestId': '',
        'responseTime': '2020-06-20 18:18:31',
        'lang': 'zh_TW'
    },
    'resFlag': '1',
    'resMessage': {
        'errorCode': '401',
        'errorMsg': ''
    }
};
export const api_exception = {
    'errorCode': '401',
    'errorMsg': 'Need logout'
};
