export let note_content =
 "1. 本功能提供本行掛牌之各幣別間即期（非現鈔）買賣匯率（幣別以系統實際提供者為準），至多可設定6組；通知起迄有效日最多為設定當日+365天。<br>"
 + "2. 本功能匯率比對時間為本行每營業日上午9:00至下午3:30，每半小時比對一次。<br>"
 + "3. 本功能之新增、修改、刪除，將於設定完成後下一匯率比對時間開始進行服務。<br>"
 + "<span style='font-weight:900;'>4. 於設定通知有效期間內，經依本注意事項約定之方式比對，若本行即期兌換匯率到達指定匯率時，即以電子郵件方式寄送通知至您目前設定的電子郵件通知信箱，同一日內若多次到價，僅於當日第一次到價時通知。<br></span>"
 + "5. 參考匯率係指設定當時本行牌告匯率；若非營業時間則為前一營業時段收盤價。<br>"
 + "<span style='font-weight:900;'>6. 本功能提供之匯率到價資訊僅為一提醒通知，基於國際匯率為即時變動，您欲進行實際交易仍需以交易當時本行之牌告或揭露為依據。<br></span>"
 + "<span style='font-weight:900;'>7. 本功能係由您自行操作新增、修改、刪除及維護其匯率到價通知內容，因設定或未設定而產生之任何情事請自行負責。<br></span>"
 + "<span style='font-weight:900;'>8. 本功能如遇系統維護或通訊線路異常時，可能發生到價通知無法送達或延遲送達之情況，請您仍應自行查看匯率變動，不得因此向本行為任何主張。</span>";

export let currency_converter_content =
    "幣別：分為即期與現金，美金即期匯率有分小額、大額。<br>"
    + "幣別選擇規則：<br>"
    + "當為「現金」匯率時，僅提供台轉外與外轉台，不提供外轉外。<br>";
