/**
 * 模擬api
 */
let term4 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_A 高收益A
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">以投資高收益債券為訴求之基金風險預告書</br>台端於決定投資前，應充分瞭解下列以投資高收益債券為訴求之基金之特有風險：</p><p class="txt_bold">ㄧ、信用風險：</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">由於高收益債券之信用評等未達投資等級或未經信用評等，可能面臨債券發行機構違約不支付本金、利息或破產之風險。</li></ol><p class=\"txt_bold\">二、利率風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">由於債券易受利率之變動而影響其價格，故可能因利率上升導致債券價格下跌，而蒙受虧損之風險，高收益債亦然。</li></ol><p class="txt_bold">三、流動性風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券可能因市場交易不活絡而造成流動性下降，而有無法在短期內依合理價格出售的風險。</li></ol><p class=\"txt_bold\">四、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">另可能產生非高收益債券基金特有之一般風險包括匯兌風險、市場風險、最低收益風險、再投資風險、事件風險、國家風險、通貨膨脹風險、稅賦風險、產業景氣循環變動風險、證券相關商品交易風險、法令風險、貨幣風險等風險，或因前述風險導致基金大量買回或基金暫停計算買回價格等因素，致延遲給付買回價款。若投資人投資於後收型基金時將可能產生提前贖回風險。投資人應選擇適合自身風險承受度之投資標的。</li></ol><p class=\"txt_bold\">五、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">本類基金主要係投資於非投資等級之高風險債券，或本類基金有相當比重投資於非投資等級之高風險債券。本類基金適合尋求投資固定收益之潛在收益且能承受較高風險之非保守型投資人;投資人投資以高收益債券為訴求之基金不宜占其投資組合過高之比重，且不適合無法承擔相關風險之投資人。投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。</li></ol><p class=\"txt_bold\">六、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金配息率不代表基金報酬率，且過去配息率不代表未來配息率；基金淨資產價值可能因市場因素而上下波動。若高收益債券基金為配息型，基金的配息可能由基金的收益或本金中支付，任何涉及由本金支出的部份，可能導致原始投資金額減損。本類基金配息前可能未先扣除應負擔之相關費用。投資人於申購時應謹慎考量。</li></ol><p class=\"txt_bold\">七、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券基金可能投資美國 Rule144A債券(境內基金投資比例最高可達基金總資產30%；境外基金不限)，該債券屬私募性質，易發生流動性不足，財務訊息揭露不完整或價格不透明導致高波動性之風險。</li></ol><p class=\"txt_bold\">八、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資不受存款保險、保險安定基金或其他相關保障機制之保障，投資人須自負盈虧</li></ol><p class=\"txt_bold\">九、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資可能產生的最大損失為全部本金。本風險預告書之預告事項甚為簡要，對所有基金投資之風險及影響市場行情之因素無法一一詳述，投資人於交易前除須對本風險預告書詳加研析外，尚應審慎詳讀各基金公開說明書，並對其他可能影響之因素亦須慎思明辨，並確實做好財務規劃及風險評估，以免因交易而遭到無法承受之損失。</li></ol>', // 內容
                version: '2.1' // 條款版本
            },

            // term4_B 高收益B
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">本基金配息前未先扣除應負擔之相關費用。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style="list-style-type: "";">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">三、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            },

            // term4_C 高收益C
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_AB = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_A 高收益A
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">以投資高收益債券為訴求之基金風險預告書</br>台端於決定投資前，應充分瞭解下列以投資高收益債券為訴求之基金之特有風險：</p><p class="txt_bold">ㄧ、信用風險：</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">由於高收益債券之信用評等未達投資等級或未經信用評等，可能面臨債券發行機構違約不支付本金、利息或破產之風險。</li></ol><p class=\"txt_bold\">二、利率風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">由於債券易受利率之變動而影響其價格，故可能因利率上升導致債券價格下跌，而蒙受虧損之風險，高收益債亦然。</li></ol><p class="txt_bold">三、流動性風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券可能因市場交易不活絡而造成流動性下降，而有無法在短期內依合理價格出售的風險。</li></ol><p class=\"txt_bold\">四、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">另可能產生非高收益債券基金特有之一般風險包括匯兌風險、市場風險、最低收益風險、再投資風險、事件風險、國家風險、通貨膨脹風險、稅賦風險、產業景氣循環變動風險、證券相關商品交易風險、法令風險、貨幣風險等風險，或因前述風險導致基金大量買回或基金暫停計算買回價格等因素，致延遲給付買回價款。若投資人投資於後收型基金時將可能產生提前贖回風險。投資人應選擇適合自身風險承受度之投資標的。</li></ol><p class=\"txt_bold\">五、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">本類基金主要係投資於非投資等級之高風險債券，或本類基金有相當比重投資於非投資等級之高風險債券。本類基金適合尋求投資固定收益之潛在收益且能承受較高風險之非保守型投資人;投資人投資以高收益債券為訴求之基金不宜占其投資組合過高之比重，且不適合無法承擔相關風險之投資人。投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。</li></ol><p class=\"txt_bold\">六、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金配息率不代表基金報酬率，且過去配息率不代表未來配息率；基金淨資產價值可能因市場因素而上下波動。若高收益債券基金為配息型，基金的配息可能由基金的收益或本金中支付，任何涉及由本金支出的部份，可能導致原始投資金額減損。本類基金配息前可能未先扣除應負擔之相關費用。投資人於申購時應謹慎考量。</li></ol><p class=\"txt_bold\">七、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券基金可能投資美國 Rule144A債券(境內基金投資比例最高可達基金總資產30%；境外基金不限)，該債券屬私募性質，易發生流動性不足，財務訊息揭露不完整或價格不透明導致高波動性之風險。</li></ol><p class=\"txt_bold\">八、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資不受存款保險、保險安定基金或其他相關保障機制之保障，投資人須自負盈虧</li></ol><p class=\"txt_bold\">九、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資可能產生的最大損失為全部本金。本風險預告書之預告事項甚為簡要，對所有基金投資之風險及影響市場行情之因素無法一一詳述，投資人於交易前除須對本風險預告書詳加研析外，尚應審慎詳讀各基金公開說明書，並對其他可能影響之因素亦須慎思明辨，並確實做好財務規劃及風險評估，以免因交易而遭到無法承受之損失。</li></ol>', // 內容
                version: '2.1' // 條款版本
            },

            // term4_B 高收益B
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">本基金配息前未先扣除應負擔之相關費用。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style="list-style-type: "";">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">三、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_AC = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_A 高收益A
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">以投資高收益債券為訴求之基金風險預告書</br>台端於決定投資前，應充分瞭解下列以投資高收益債券為訴求之基金之特有風險：</p><p class="txt_bold">ㄧ、信用風險：</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">由於高收益債券之信用評等未達投資等級或未經信用評等，可能面臨債券發行機構違約不支付本金、利息或破產之風險。</li></ol><p class=\"txt_bold\">二、利率風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">由於債券易受利率之變動而影響其價格，故可能因利率上升導致債券價格下跌，而蒙受虧損之風險，高收益債亦然。</li></ol><p class="txt_bold">三、流動性風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券可能因市場交易不活絡而造成流動性下降，而有無法在短期內依合理價格出售的風險。</li></ol><p class=\"txt_bold\">四、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">另可能產生非高收益債券基金特有之一般風險包括匯兌風險、市場風險、最低收益風險、再投資風險、事件風險、國家風險、通貨膨脹風險、稅賦風險、產業景氣循環變動風險、證券相關商品交易風險、法令風險、貨幣風險等風險，或因前述風險導致基金大量買回或基金暫停計算買回價格等因素，致延遲給付買回價款。若投資人投資於後收型基金時將可能產生提前贖回風險。投資人應選擇適合自身風險承受度之投資標的。</li></ol><p class=\"txt_bold\">五、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">本類基金主要係投資於非投資等級之高風險債券，或本類基金有相當比重投資於非投資等級之高風險債券。本類基金適合尋求投資固定收益之潛在收益且能承受較高風險之非保守型投資人;投資人投資以高收益債券為訴求之基金不宜占其投資組合過高之比重，且不適合無法承擔相關風險之投資人。投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。</li></ol><p class=\"txt_bold\">六、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金配息率不代表基金報酬率，且過去配息率不代表未來配息率；基金淨資產價值可能因市場因素而上下波動。若高收益債券基金為配息型，基金的配息可能由基金的收益或本金中支付，任何涉及由本金支出的部份，可能導致原始投資金額減損。本類基金配息前可能未先扣除應負擔之相關費用。投資人於申購時應謹慎考量。</li></ol><p class=\"txt_bold\">七、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券基金可能投資美國 Rule144A債券(境內基金投資比例最高可達基金總資產30%；境外基金不限)，該債券屬私募性質，易發生流動性不足，財務訊息揭露不完整或價格不透明導致高波動性之風險。</li></ol><p class=\"txt_bold\">八、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資不受存款保險、保險安定基金或其他相關保障機制之保障，投資人須自負盈虧</li></ol><p class=\"txt_bold\">九、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資可能產生的最大損失為全部本金。本風險預告書之預告事項甚為簡要，對所有基金投資之風險及影響市場行情之因素無法一一詳述，投資人於交易前除須對本風險預告書詳加研析外，尚應審慎詳讀各基金公開說明書，並對其他可能影響之因素亦須慎思明辨，並確實做好財務規劃及風險評估，以免因交易而遭到無法承受之損失。</li></ol>', // 內容
                version: '2.1' // 條款版本
            },
            // term4_C 高收益C
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_BC = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_B 高收益B
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">本基金配息前未先扣除應負擔之相關費用。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style="list-style-type: "";">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">三、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            },
            // term4_C 高收益C
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_A = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_A 高收益A
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">以投資高收益債券為訴求之基金風險預告書</br>台端於決定投資前，應充分瞭解下列以投資高收益債券為訴求之基金之特有風險：</p><p class="txt_bold">ㄧ、信用風險：</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">由於高收益債券之信用評等未達投資等級或未經信用評等，可能面臨債券發行機構違約不支付本金、利息或破產之風險。</li></ol><p class=\"txt_bold\">二、利率風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">由於債券易受利率之變動而影響其價格，故可能因利率上升導致債券價格下跌，而蒙受虧損之風險，高收益債亦然。</li></ol><p class="txt_bold">三、流動性風險：</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券可能因市場交易不活絡而造成流動性下降，而有無法在短期內依合理價格出售的風險。</li></ol><p class=\"txt_bold\">四、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">另可能產生非高收益債券基金特有之一般風險包括匯兌風險、市場風險、最低收益風險、再投資風險、事件風險、國家風險、通貨膨脹風險、稅賦風險、產業景氣循環變動風險、證券相關商品交易風險、法令風險、貨幣風險等風險，或因前述風險導致基金大量買回或基金暫停計算買回價格等因素，致延遲給付買回價款。若投資人投資於後收型基金時將可能產生提前贖回風險。投資人應選擇適合自身風險承受度之投資標的。</li></ol><p class=\"txt_bold\">五、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">本類基金主要係投資於非投資等級之高風險債券，或本類基金有相當比重投資於非投資等級之高風險債券。本類基金適合尋求投資固定收益之潛在收益且能承受較高風險之非保守型投資人;投資人投資以高收益債券為訴求之基金不宜占其投資組合過高之比重，且不適合無法承擔相關風險之投資人。投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。</li></ol><p class=\"txt_bold\">六、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金配息率不代表基金報酬率，且過去配息率不代表未來配息率；基金淨資產價值可能因市場因素而上下波動。若高收益債券基金為配息型，基金的配息可能由基金的收益或本金中支付，任何涉及由本金支出的部份，可能導致原始投資金額減損。本類基金配息前可能未先扣除應負擔之相關費用。投資人於申購時應謹慎考量。</li></ol><p class=\"txt_bold\">七、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">高收益債券基金可能投資美國 Rule144A債券(境內基金投資比例最高可達基金總資產30%；境外基金不限)，該債券屬私募性質，易發生流動性不足，財務訊息揭露不完整或價格不透明導致高波動性之風險。</li></ol><p class=\"txt_bold\">八、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資不受存款保險、保險安定基金或其他相關保障機制之保障，投資人須自負盈虧</li></ol><p class=\"txt_bold\">九、</p><ol class=\"note_ol_content\"><li style=\"list-style-type: "";\">基金投資可能產生的最大損失為全部本金。本風險預告書之預告事項甚為簡要，對所有基金投資之風險及影響市場行情之因素無法一一詳述，投資人於交易前除須對本風險預告書詳加研析外，尚應審慎詳讀各基金公開說明書，並對其他可能影響之因素亦須慎思明辨，並確實做好財務規劃及風險評估，以免因交易而遭到無法承受之損失。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_B = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_B 高收益B
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">本基金配息前未先扣除應負擔之相關費用。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style="list-style-type: "";">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">三、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term04_C = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term4_C 高收益C
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">基金配息可能涉及本金之風險預告書</p><p class="txt_bold">ㄧ、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。投資人交易前已詳閱公開說明書或投資人須知，並瞭解相關風險告知事項。</li></ol><p class="txt_bold">二、</p><ol class="note_ol_content"><li style=\"list-style-type: "";\">當基金得以其本金支付配息時，其配息相關資料(包括但不限於配息組成項目)參閱證券投資信託事業或總代理人之網站或其提供之基金銷售文件（包括但不限於公開說明書、簡式公開說明書或境外基金投資人須知）。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term9 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [ // 後收型基金風險預告書
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term10 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: 'https://announce.fundclear.com.tw/MOPSFundWeb/UploadInfoGet2?seq=914720', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term11 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            // term11 信託資金集合管理運用帳戶稅負說明書
            // 自然人
            // {
            //     termsId: '', // 條款id
            //     type: '1', // 1:顯示, 2:外連
            //     terms: '<p class="txt_bold">信託資金集合管理運用帳戶即委託人將資金信託給受託人（上海商業儲蓄銀行），由受託人將相同投資運用範圍之委託人之資金集合管理運用。信託架構下之課稅原則係採信託導管理論，即委託人雖透過受託人將信託利益移轉予受益人，但其原來取得之所得形式，透過信託架構仍然不會改變。復依所得稅法第3-4條規定，集合管理運用帳戶所產生之信託收益應於所得發生年度列入受益人之所得課徵所得稅。準此，無論集合管理運用帳戶之受託人是否將信託收益實際給付受益人，集合管理運用帳戶之受託人均將於各項信託收益發生年度減除相關成本、必要費用及損耗後，依各類所得項目轉開扣繳憑單予受益人，受益人應併入受益人當年度所得額，依所得稅法規定辦理申報及納稅。(例如：委託人即受益人於108年1月2日加入本行某一檔集合管理運用帳戶，然後於108年1月4日退出，由於委託人於108年仍持有3天該檔集合管理運用帳戶，故本行於109年1月申報108年信託所得時，仍會依所得稅法規定開立所得相關資訊予委託人，委託人仍需依所得稅法規定辦理申報及納稅)</p><br><p class="txt_bold">自然人投資集合管理運用帳戶，委託人即受益人，信託利益全部由委託人享有，依所得類別，相關稅負說明如下：</p><ol class="note_ol_content"><li class="nonelist">所得類別1：利息所得：</li><li class="nonelist">所得類別1稅負說明：集合管理運用帳戶投資於國內銀行存款之利息收入，併入受益人所得發生年度之綜合所得額課稅，惟存款之利息收入得適用所得稅法第17條第1項第2款第3目之3儲蓄投資特別扣除之規定。集合管理運用帳戶持有公債、公司債及金融債券之利息所得、短期票券從事附條件交易，到期賣回金額超過原買入金額部分之利息所得，不併計綜合所得總額，其利息所得不適用所得稅法第17條第1項第2款第3目之3儲蓄投資特別扣除之規定。    </li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別2：股利或盈餘所得：</li><li class="nonelist">所得類別2稅負說明：集合管理運用帳戶投資於國內營利事業所獲配之股利或盈餘，依所得稅法第14條第1項第1款之規定，併入受益人當年度之綜合所得額課稅，惟相關抵減得適用所得稅法第15條第4項及第5項之規定。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別3：期貨或證券交易利得：</li><li class="nonelist">所得類別3稅負說明：集合管理運用帳戶從事國內有價證券或期貨交易產生之交易所得，依所得稅法第4-1及4-2條規定，免予計入受益人當年度之綜合所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別4：財產交易所得：</li><li class="nonelist">所得類別4稅負說明：集合管理運用帳戶買賣外幣或換匯避險之交易所得，均屬所得稅法第14條第1項第7款所規定之財產交易所得，應併入受益人當年度之綜合所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別5：其他所得：</li><li class="nonelist">所得類別5稅負說明：集合管理運用帳戶運用信託財產所衍生之其他收益，屬所得稅法第14條第1項第10款所規定之其他所得，應併入受益人當年度之綜合所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別6：海外所得：</li><li class="nonelist">所得類別6稅負說明：集合管理運用帳戶運用資金存放於中華民國境外之存款及投資有價證券所產生其他收益，屬所得基本稅額條例第12條第1項第1款規定之所得，應併入受益人當年度之基本所得額課稅。但一申報戶全年之本款所得合計數未達新臺幣一百萬元者，免予計入。</li></ol><br><p class="txt_bold">基於每個人之資產狀況或稅法適用規定不同，委託人即受益人應自行依中華民國相關法令規定，辦理申報及納稅事宜。</p><ol class="note_ol_content"><li class="nonelist">國內所得：依「所得稅法」第110條第1項規定，納稅義務人已依本法規定辦理結算、決算或清算申報，而對依本法規定應申報課稅之所得額有漏報或短報情事者，處以所漏稅額二倍以下之罰鍰。依同條第 2 項規定，納稅義務人未依本法規定自行辦理結算、決算或清算申報，而經稽徵機關調查，發現有依本法規定課稅之所得額者，除依法核定補徵應納稅額外，應照補徵稅額，處三倍以下之罰鍰。</li><li class="nonelist">海外所得：依「所得基本稅額條例」第 15 條第 1 項規定，營利事業或個人已依本條例規定計算及申報基本所得額，有漏報或短報致短漏稅額之情事者，處以所漏稅額二倍以下之罰鍰。依同條第 2 項規定，營利事業或個人未依本條例規定計算及申報基本所得額，經稽徵機關調查，發現有依本條例規定應課稅之所得額者，除依規定核定補徵應納稅額外，應按補徵稅額，處三倍以下之罰鍰。</li></ol><br><p class="txt_bold">委託人即受益人茲聲明已清楚瞭解本「信託資金集合管理運用帳戶自然人稅負說明書」之所有內容，並願意投資本商品。</p><br><p class="txt_bold">此致</p><p class="txt_bold">上海商業儲蓄銀行</p><br><p class="txt_bold">注意事項：</p><ol class="note_ol_content"><li class="nonelist">一、信託資金集合管理運用帳戶具有風險，委託人簽約前應詳細閱讀集合管理運用帳戶約定條款。</li><li class="nonelist">二、信託業應盡善良管理人之注意義務，但不擔保信託資金集合管理運用帳戶之本金或最低收益。</li></ol>', // 內容
            //     version: '2.1' // 條款版本
            // },
            // 法人
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">信託資金集合管理運用帳戶即委託人將資金信託給受託人（上海商業儲蓄銀行），由受託人將相同投資運用範圍之委託人之資金集合管理運用。信託架構下之課稅原則係採信託導管理論，即委託人雖透過受託人將信託利益移轉予受益人，但其原來取得之所得形式，透過信託架構仍然不會改變。復依所得稅法第3-4條規定，集合管理運用帳戶所產生之信託收益應於所得發生年度列入受益人之所得課徵所得稅。準此，無論集合管理運用帳戶之受託人是否將信託收益實際給付受益人，集合管理運用帳戶之受託人均將於各項信託收益發生年度減除相關成本、必要費用及損耗後，依各類所得項目轉開扣繳憑單予受益人，受益人應併入受益人當年度所得額，依所得稅法規定辦理申報及納稅。(例如：委託人即受益人於108年1月2日加入本行某一檔集合管理運用帳戶，然後於108年1月4日退出，由於委託人於108年仍持有3天該檔集合管理運用帳戶，故本行於109年1月申報108年信託所得時，仍會依所得稅法規定開立所得相關資訊予委託人，委託人仍需依所得稅法規定辦理申報及納稅)</p><br><p class="txt_bold">法人投資集合管理運用帳戶，委託人即受益人，信託利益全部由委託人享有，依所得類別，相關稅負說明如下：</p><ol class="note_ol_content"><li class="nonelist">所得類別1：利息所得：</li><li class="nonelist">所得類別1稅負說明：集合管理運用帳戶投資於國內銀行存款之利息收入，併入受益人當年度之營利事業所得額課稅。集合管理運用帳戶持有公債、公司債及金融債券之利息收入、短期票券從事附條件交易，到期賣回金額超過原買入金額部分之利息所得，併入受益人當年度之營利事業所得額課稅，該扣繳稅款得自營利事業所得稅結算申報應納稅額中減除。        </li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別2：股利或盈餘所得：</li><li class="nonelist">所得類別2稅負說明：集合管理運用帳戶投資於國內營利事業所獲配之股利或盈餘，應併入受益人當年度之營利事業所得額申報，惟依所得稅法第42條之規定，不計入受益人當年度之營利事業所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別3：期貨或證券交易利得：</li><li class="nonelist">所得類別3稅負說明：集合管理運用帳戶從事國內有價證券或期貨交易產生之交易所得，依所得稅法第4-1及4-2條規定，免予計入受益人當年度之營利事業所得額課稅，惟應依所得基本稅額條例第7條第1項第1款之規定，併入受益人當年度基本所得額，計算基本稅額。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別4：財產交易所得：</li><li class="nonelist">所得類別4稅負說明：集合管理運用帳戶買賣外幣或換匯避險之交易所得，均屬所得稅法第14條第1項第7款所規定之財產交易所得，應計入受益人當年度之營利事業所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別5：其他所得：</li><li class="nonelist">所得類別5稅負說明：集合管理運用帳戶運用信託財產所衍生之其他收益，屬所得稅法第14條第1項第10款所規定之其他所得，應併入受益人當年度之營利事業所得額課稅。</li></ol><br><ol class="note_ol_content"><li class="nonelist">所得類別6：海外所得：</li><li class="nonelist">所得類別6稅負說明：集合管理運用帳戶運用資金存放於中華民國境外之存款及投資有價證券所產生其他收益，依所得稅法第3條第2項之規定應併入受益人當年度之營利事業所得額課稅。</li></ol><br>     <p class="txt_bold">基於各營利事業之財務政策或會計基礎不同，委託人即受益人應就本身帳務處理方式，自行依中華民國相關法令規定辦理申報及納稅事宜。</p><ol class="note_ol_content"><li class="nonelist">國內所得：依「所得稅法」第110條第1項規定，納稅義務人已依本法規定辦理結算、決算或清算申報，而對依本法規定應申報課稅之所得額有漏報或短報情事者，處以所漏稅額二倍以下之罰鍰。依同條第2項規定，納稅義務人未依本法規定自行辦理結算、決算或清算申報，而經稽徵機關調查，發現有依本法規定課稅之所得額者，除依法核定補徵應納稅額外，應照補徵稅額，處三倍以下之罰鍰。</li><li class="nonelist">海外所得：依「所得基本稅額條例」第 15 條第 1 項規定，營利事業或個人已依本條例規定計算及申報基本所得額，有漏報或短報致短漏稅額之情事者，處以所漏稅額二倍以下之罰鍰。依同條第 2 項規定，營利事業或個人未依本條例規定計算及申報基本所得額，經稽徵機關調查，發現有依本條例規定應課稅之所得額者，除依規定核定補徵應納稅額外，應按補徵稅額，處三倍以下之罰鍰。</li></ol><br><p class="txt_bold">委託人即受益人茲聲明已清楚瞭解本「信託資金集合管理運用帳戶法人稅負說明書」之所有內容，並願意投資本商品。</p><br><p class="txt_bold">此致</p><p class="txt_bold">上海商業儲蓄銀行</p><br><p class="txt_bold">注意事項：</p><ol class="note_ol_content"><li class="nonelist">一、信託資金集合管理運用帳戶具有風險，委託人簽約前應詳細閱讀集合管理運用帳戶約定條款。</li><li class="nonelist">二、信託業應盡善良管理人之注意義務，但不擔保信託資金集合管理運用帳戶之本金或最低收益。</li></ol>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term12 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [ // 信託管理書
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: '<p class="txt_bold">上海商業儲蓄銀行（以下簡稱本公司）</p><p class="txt_bold">為便於台端﹙貴公司、貴機構﹚瞭解信託業兼營全權委託投資業務及本公司之經營，爰依「信託業兼營全權委託投資業務操作辦法」第九條規定，於  台端﹙貴公司、貴機構﹚與本公司簽訂信託契約約定相關條款七日前，向  台端﹙貴公司、貴機構﹚說明並交付記載以下事項之信託管理說明書（詳細內容如後附）一式二份：</p><br><ol class="note_ol_content"><li class="nonelist">一、本公司辦理信託業兼營全權委託投資業務之性質、範圍、經營原則、收費方式、禁止規定、委託人及本公司之法律關係及運作方式等。</li></ol><ol class="note_ol_content"><li class="nonelist">二、本公司運用資金從事全權決定運用信託財產為有價證券投資或證券相關商品交易之分析方法、資訊來源及投資策略。</li></ol><ol class="note_ol_content"><li class="nonelist">三、本公司辦理信託業兼營全權委託投資業務之主管及業務人員之學歷、經歷及最近二年有無受證券投資信託及顧問法第一百零四條、期貨交易法第一百零一條或證券交易法第五十六條規定之處分情形。</li></ol><ol class="note_ol_content"><li class="nonelist">四、本公司最近二年度綜合損益表及資產負債表。</li></ol><ol class="note_ol_content"><li class="nonelist">五、本公司有無因辦理全權決定運用信託財產為有價證券投資或證券相關商品交易業務，發生訴訟、非訟事件之說明。</li></ol><ol class="note_ol_content"><li class="nonelist">六、最近二年本公司及其負責人有無受證券投資信託及顧問法第一百零三條或第一百零四條、期貨交易法第一百條或第一百零一條、證券交易法第五十六條或第六十六條、或信託業法第四十四條規定之處分情形。</li></ol><ol class="note_ol_content"><li class="nonelist">七、投資或交易風險警語、投資或交易標的之特性、可能之風險及法令限制。</li></ol><ol class="note_ol_content"><li class="nonelist">八、信託資金集合管理運用帳戶配息來源可能涉及本金之風險告知。</li></ol><ol class="note_ol_content"><li class="nonelist">九、委託人及受益人同意受託人運用信託財產買賣外國有價證券，得委託提供國外投資顧問服務之公司或其集團企業提供集中交易服務間接向國外證券商委託交易。</li></ol><ol class="note_ol_content"><li class="nonelist">若台端﹙貴公司、貴機構﹚對於所附說明之內容確已知悉及收訖，除請自行留存一份外，請於本頁簽名或用印後，將另一份交回本公司存查。</li></ol><br><ol class="note_ol_content"><li class="nonelist">投資或交易風險警語：</li><li class="nonelist">1.信託財產之管理運用並非絕無風險，本公司以往之經理績效不保證全權決定運用信託財產為有價證券投資資金之最低收益；本公司除盡善良管理人之注意義務外，不負責全權決定運用信託財產為有價證券投資資金之盈虧，亦不保證最低之收益，委託人簽約前應詳閱本說明書。</li><li class="nonelist">2.本信託管理說明書之內容由信託業及其行為負責人與其他曾在本信託管理說明書上簽章者依法負責。</li><li class="nonelist">3.信託資金集合管理運用帳戶具有風險，委託人簽約前應詳細閱讀集合管理運用帳戶約定條款。</li><li class="nonelist">4.信託業應盡善良管理人之注意義務，但不擔保信託資金集合管理運用帳戶之本金或最低收益。</li><li class="nonelist">5.信託資金投資於具有定期配息性質之金融商品時，該金融商品並非存款，不屬於存款保險條例所保障之範圍。</li></ol><ol class="note_ol_content"><li class="nonelist">配息來源可能涉及本金之風險告知：</li><li class="nonelist">1.信託資金集合管理運用帳戶的配息可能由帳戶的收益或本金中支付。任何涉及由本金支付者，可能導致原始投資金額減損。</li><li class="nonelist">2.信託資金集合管理運用帳戶近12個月由本金支付配息之相關資料，可於本公司財富管理網之集合管理運用帳戶專區查詢﹙http://fund.scsb.com.tw/collected_account.jsp﹚。</li></ol><br><p class="txt_bold">一、本公司辦理信託資金集合管理運用帳戶業務之性質、範圍、經營原則、收費方式、禁止規定、委託人及本公司之法律關係及運作方式：</p><ol class="note_ol_content"><li class="nonelist">﹙一﹚性質：信託業兼營全權委託投資業務。</li><li class="nonelist">﹙二﹚範圍：本公司應依信託契約約定之目的，按集合管理運用帳戶約定條款所定營運範圍及方法，為受益人之利益，運用集合管理運用帳戶之信託資金於銀行存款、短期票券（國庫券、可轉讓銀行定期存單、公司及公營事業機構發行之本票或匯票、其他經主管機關核准之短期債務憑證）、固定收益有價證券、附買回交易（含短期票券及固定收益有價證券）、證券投資信託事業或外國基金管理機構所發行或經理之受益憑證或基金股份或投資單位、信託業所募集發行之共同信託基金受益證券、衍生性商品之交易（應僅限於避險操作之目的，並遵守主管機關及中華民國信託業商業同業公會訂定有關信託業運用信託財產從事衍生性金融商品交易規範之相關規定辦理）、國內外指數股票型基金（ETF，Exchange Traded Fund）及其他經主管機關核准之投資標的。</li><li class="nonelist">﹙三﹚經營原則：本公司辦理全權委託投資業務之經營原則，係為保障委託人及受益人權益，依信託法、信託業法及相關法令規定，本公司應遵守注意義務、忠實義務、誠實義務、保證收益禁止、資訊揭露原則、專業原則、保密原則、謹慎管理原則及公平競爭原則等。</li><li class="nonelist">﹙四﹚收費方式：信託報酬及信託手續費，請參閱｢金錢信託開戶及各項服務約定書｣之信託資金集合管理運用帳戶信託報酬及手續費約定條款。</li><li class="nonelist">﹙五﹚禁止規定：不得以集合管理運用帳戶之信託財產為下列行為﹙但政府發行之債券，不受限制﹚：1.購買本身或其利害關係人發行或承銷之有價證券或票券。2.購買本身或其利害關係人之財產。3.讓售與本身或其利害關係人。4.其他經主管機關規定之利害關係交易行為。</li><li class="nonelist">﹙六﹚委託人及本公司之法律關係：本公司以信託方式經營全權委託投資業務，應與客戶簽訂信託契約，客戶為委託人及受益人，本公司為受託人，信託關係成立後，屬於信託財產之委託投資資產，應以本公司為名義所有人，而由本公司負責管理或處分。</li><li class="nonelist">﹙七﹚運作方式：由本公司依集合管理運用帳戶約定條款規定之範圍及方法為信託財產之管理運用，本公司於約定條款規定範圍內，對加入該集合管理運用帳戶之信託財產具有運用決定權。</li></ol><br><p class="txt_bold">二、本公司運用資金從事全權決定運用信託財產為有價證券投資或證券相關商品交易之分析方法、資訊來源及投資策略：</p><ol class="note_ol_content"><li class="nonelist">﹙一﹚分析方法：由研究員充分蒐集資料，審慎求證分析，力求詳實週延，避免不實之陳述，並作成書面報告連同引證資料留存備查。完整的報告內容涵蓋總體經濟分析、產業分析、個別公司各項財務資料分析、產品及其市場分析、股價變動分析與公司未來發展趨勢分析等。</li><li class="nonelist">﹙二﹚資訊來源：研究員為確實有效掌握資訊，除參考本公司或其他專業機構之期刊及報告、上市（櫃）公司財務報表及營運計畫、電子資訊及其他書面資料外，亦可拜訪公司或專業人士，或參加研討會、業績發表會等蒐集研究相關資訊之活動。</li><li class="nonelist">﹙三﹚投資策略：以主動式管理適時進行投資組合之調整，掌握市場趨勢，並以分散風險、確保集合管理運用帳戶之安全，穩健追求中長期之投資利得，及維持收益之安定為目標。</li></ol><br><p class="txt_bold">三、本公司辦理信託業兼營全權委託投資業務之主管及業務人員之學歷、經歷及最近二年有無受證券投資信託及顧問法第一百零四條、期貨交易法第一百零一條或證券交易法第五十六條規定之處分情形：無。</p><ol class="note_ol_content"><li class="nonelist">﹙一﹚全權委託投資業務主管：李根田﹙台灣大學商學系﹚。</li><li class="nonelist">﹙二﹚資產運用經理人：馮振杰﹙政治大學經濟學系、中山大學經濟學研究所﹚、倪子鵬﹙輔仁大學金融與國際企業研究所﹚。</li><li class="nonelist">﹙三﹚最近二年本公司辦理信託業兼營全權委託投資業務之主管及業務人員有無受證券投資信託及顧問法第一百零四條、期貨交易法第一百零一條或證券交易法第五十六條規定之處分情形：無。</li></ol><br><p class="txt_bold">四、本公司最近二年度綜合損益表及資產負債表：</p><ol class="note_ol_content"><li class="nonelist">﹙一﹚綜合損益表：請參閱本公司網站﹙http://www.scsb.com.tw/content/about/about04_a_01.jsp﹚</li><li class="nonelist">﹙二﹚資產負債表：請參閱本公司網站﹙http://www.scsb.com.tw/content/about/about04_a_01.jsp﹚</li></ol><br><p class="txt_bold">五、本公司有無因辦理全權決定運用信託財產為有價證券投資或證券相關商品交易業務，發生訴訟、非訟事件之說明：無。</p><br><p class="txt_bold">六、最近二年本公司及其負責人有無受證券投資信託及顧問法第一百零三條或第一百零四條、期貨交易法第一百條或第一百零一條、證券交易法第五十六條或第六十六條、或信託業法第四十四條規定之處分情形：無。</p><br><p class="txt_bold">七、投資或交易風險警語、投資或交易標的之特性、可能之風險及法令限制：</p><ol class="note_ol_content"><li class="nonelist">﹙一﹚投資或交易風險警語：1. 信託財產之管理運用並非絕無風險，本公司以往之經理績效不保證全權決定運用信託財產為有價證券投資資金之最低收益；本公司除盡善良管理人之注意義務外，不負責全權決定運用信託財產為有價證券投資資金之盈虧，亦不保證最低之收益，委託人簽約前應詳閱本說明書。2. 本信託管理說明書之內容由信託業及其行為負責人與其他曾在本信託管理說明書上簽章者依法負責。3. 信託資金集合管理運用帳戶具有風險，委託人簽約前應詳細閱讀集合管理運用帳戶約定條款。4. 信託業應盡善良管理人之注意義務，但不擔保信託資金集合管理運用帳戶之本金或最低收益。5. 信託資金投資於具有定期配息性質之金融商品時，該金融商品並非存款，不屬於存款保險條例所保障之範圍。</li><li class="nonelist">﹙二﹚投資或交易標的之特性：本公司辦理信託資金集合管理運用帳戶，以主動式管理適時進行投資組合之調整，掌握市場趨勢，投資或交易標的以分散風險、確保集合管理運用帳戶之安全，穩健追求中、長期之投資利得及維持收益之安定為目標。</li><li class="nonelist">﹙三﹚可能之風險：委託人加入集合管理運用帳戶前，應確實於合理期間詳閱各該集合管理運用帳戶約定條款及相關資料，並瞭解其投資可能產生之風險，包括但不限於運用標的可能發生之跌價風險、信用風險或匯兌損失所導致之本金虧損，或運用標的暫停接受贖回及解散、清算等風險，最大可能損失為喪失全部投資本息；且委託人承諾其係基於其獨立審慎之投資判斷，而自行決定加入各該集合管理運用帳戶。信託資金管理運用所生之資本利得及其孳息收益等，悉數歸受益人所享有；其運用所生風險、費用及稅賦亦悉數由受益人負擔，受託人依法不得擔保信託本金及最低收益率。信託資金經運用於存款以外之標的者，不受存款保險之保障。</li><li class="nonelist">﹙四﹚法令限制：依信託資金集合管理運用管理辦法第九條規定，本公司辦理信託資金集合管理運用之運用範圍，以具有次級交易市場之投資標的為原則，並應依各該集管帳戶之性質，遵守下列規定：1、除已獲准上市、上櫃而正辦理承銷中之股票外，不得投資未上市、未上櫃公司股票。2、不得辦理放款或提供擔保。3、不得從事證券信用交易。4、本身管理之各集合管理運用帳戶間不得互為交易。5、投資於任一上市、上櫃公司發行之股票、存託憑證、公司債、金融債券及短期票券之金額，分別不得超過個別集合管理運用帳戶投資當日淨資產價值百分之十。6、本公司所設置之全體集合管理運用帳戶，投資於任一上市、上櫃公司發行之股票、存託憑證、公司債、金融債券及短期票券之金額，合計不得超過投資當日該公司實收資本額百分之十。7、存放於同一金融機構之存款、投資其發行之金融債券與其保證之公司債及短期票券金額，合計不得超過投資當日全體集合管理運用帳戶淨資產總價值百分之三十及該金融機構淨值百分之十。8、個別集合管理運用帳戶投資於任一基金受益憑證、受益證券、基金股份或投資單位（以下簡稱基金）之金額，不得超過投資當日被投資基金已發行受益權單位總數百分之十；全體集合管理運用帳戶投資於任一基金之合計金額不得超過投資當日被投資基金已發行受益權單位總數百分之二十。9、投資於任一基金之金額不得超過投資當日個別集合管理運用帳戶淨資產總價值百分之十。但該集合管理運用帳戶投資五個以上基金，並任一基金之最高投資上限未超過其淨資產價值之百分之三十，且未投資組合型基金者，不在此限。10、投資於同一證券化發行計畫下之證券化商品總金額不得超過同一證券化發行計畫總額百分之十或投資當日個別集合管理運用帳戶淨資產價值百分之十。11、投資於任一證券化商品之金額，加計該商品創始機構或委託人發行之股票、存託憑證、公司債、金融債券及短期票券之總金額，不得超過投資當日個別集合管理運用帳戶淨資產價值之百分之二十。12、個別集合管理運用帳戶投資於任一上市或上櫃公司承銷股票之總數，不得超過該次承銷總數百分之一；全體集合管理運用帳戶投資於同一次承銷股票之總數，不得超過該次承銷總數百分之三。13、本公司與證券化商品之創始機構、委託人、受託機構或特殊目的公司之任一機構具有信託資金集合管理運用管理辦法第七條所稱利害關係人之關係者，本公司不得運用集合管理運用帳戶投資於該證券化商品。14、不得投資於非屬信託資金集合管理運用管理辦法第3條第2項經主管機關核准之管理及運用計畫所訂定運用範圍之投資標的。15、除信託資金集合管理運用管理辦法第七條外，經主管機關核准之其他投資，相關管理、運用及處分等應遵循事項由主管機關另定之。﹙法令限制如因法令規定變動者，依該變動之內容辦理，如有其他限制，請參閱各該集管帳戶約定條款。﹚</li></ol><br><p class="txt_bold">八、配息來源可能涉及本金之風險告知：1. 信託資金集合管理運用帳戶的配息可能由帳戶的收益或本金中支付。任何涉及由本金支付者，可能導致原始投資金額減損。2. 信託資金集合管理運用帳戶近12個月由本金支付配息之相關資料，可於本公司財富管理網之集合管理運用帳戶專區查詢﹙http://fund.scsb.com.tw/collected_account.jsp﹚。</p><br><p class="txt_bold">九、委託人及受益人同意受託人運用信託財產買賣外國有價證券，得委託提供國外投資顧問服務之公司或其集團企業提供集中交易服務間接向國外證券商委託交易。</p>', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let term13 = {
    "apiId": "SPEC00050201",
    "token": {
        "requestId": "SPEC00050101",
        "responseTime": "2020-08-14 09:31:19",
        "lang": "zh_TW"
    },
    "resFlag": "0",
    "resContent": {
        'rowData': [
            {
                termsId: '', // 條款id
                type: '1', // 1:顯示, 2:外連
                terms: 'https://www.scsb.com.tw/content/news/src/news_020820-2.pdf', // 內容
                version: '2.1' // 條款版本
            }
        ]
    }
};

let df_response = {
    'resContent': {
        'apiId': 'SPEC00050201',
        'token': {
            'requestId': '',
            'responseTime': '',
            'lang': ''
        },
        'resFlag': '0',
        'resMessage': {
            'errorCode': '',
            'errorMsg': ''
        },
        'rowData': [
        ]
    }
};

export const api_response4 = { ...df_response, ...term4 }; // 高收益
export const api_responseAB = { ...df_response, ...term04_AB };
export const api_responseAC = { ...df_response, ...term04_AC };
export const api_responseBC = { ...df_response, ...term04_BC };
export const api_responseA = { ...df_response, ...term04_A };
export const api_responseB = { ...df_response, ...term04_B };
export const api_responseC = { ...df_response, ...term04_C };
export const api_response9 = { ...df_response, ...term9 }; // 後收型
export const api_response10 = { ...df_response, ...term10 }; // 境外基金手續費後收集別費用說明書
export const api_response11 = { ...df_response, ...term11 }; // 信託資金集合管理運用帳戶稅負說明書
export const api_response12 = { ...df_response, ...term12 }; // 信託資金集合管理運用帳戶信託管理說明書
export const api_response13 = { ...df_response, ...term13 }; // 金錢信託開戶及各項務務約定書
export const api_response_empty = { ...df_response, ...df_response };
export const api_error = {
    'apiId': 'SPEC00050201',
    'token': {
        'requestId': '',
        'responseTime': '2020-06-20 18:18:31',
        'lang': 'zh_TW'
    },
    'resFlag': '1',
    'resMessage': {
        'errorCode': 'ERRAAAAAAA',
        'errorMsg': 'Test Error'
    }
};
export const api_exception = {
    'errorCode': 'ERRAAAAAAA',
    'errorMsg': 'Test Error'
};
